var FableNames = require('../fable-names.js');
var Analyzer = FableNames.Analyzer;

var russianNames = ["Авдей", "Авксентий", "Агафон", "Александр", "Алексей", "Альберт", "Альвиан", "Анатолий", "Андрей", "Антон", "Антонин", "Аристарх", "Аркадий", "Арсений", "Артём", "Артур", "Богдан", "Борис", "Вадим", "Валентин", "Валерий", "Валерьян", "Варлам", "Василий", "Венедикт", "Вениамин", "Виктор", "Виталий", "Владимир", "Владислав", "Владлен", "Всеволод", "Вячеслав", "Гавриил", "Геласий", "Геннадий", "Георгий", "Герасим", "Герман", "Глеб", "Гордей", "Григорий", "Даниил", "Демьян", "Денис", "Дмитрий", "Дорофей", "Евгений", "Евграф", "Евсей", "Егор", "Еремей", "Ермолай", "Ефим", "Иакинф", "Иван", "Игнатий", "Игорь", "Илья", "Иннокентий", "Ириней", "Исидор", "Иулиан", "Касьян", "Ким", "Кондрат", "Константин", "Кузьма", "Куприян", "Лаврентий", "Леонид", "Леонтий", "Лука", "Лукий", "Лукьян", "Макар", "Максим", "Мартын", "Матвей", "Мелентий", "Митрофан", "Михаил", "Мстислав", "Мэлор", "Никита", "Николай", "Олег", "Онисим", "Павел", "Пантелеймон", "Парфений", "Пётр", "Порфирий", "Прокопий", "Протасий", "Прохор", "Разумник", "Роман", "Ростислав", "Руслан", "Савва", "Святослав", "Семён", "Сергей", "Созон", "Спиридон", "Станислав", "Степан", "Тимофей", "Тихон", "Трифон", "Трофим", "Фаддей", "Фёдор", "Федосей", "Федот", "Филат", "Фома", "Фрол", "Харитон", "Христофор", "Эдуард", "Эраст", "Юлиан", "Юрий", "Юстин", "Яков", "Якун", "Ярослав"];

describe('Russian male names example', function () {

    it('Analyzing and printing 10 russian-ish names', function() {
        // Analyzing array of real russian names
        var russianNamesOptions = FableNames.analyze(russianNames, "ауоыиэяюёе");

        // Adding additional pattern to skip unrealistic results
        russianNamesOptions.forbiddenPattern = /^[ъьйы]|й.*й|[ауоыиэяюёе]ь|й[ауоыиэяюёе]|йь/i;

        // Creating name generator with russian specific
        var russianNamesGenerator = new FableNames(russianNamesOptions);

        for (var index = 0; index < 10; index++) {
            
            // generate name
            var newName = russianNamesGenerator.get();

            console.log("\t" + newName);
        }
    });
    
});